Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/Microchip.PIC32CK-GC_DFP.pdsc
      <condition id="PIC32CK0512GC01064">
         <require Dvendor="Microchip:3" Dname="PIC32CK0512GC01064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK0512GC01100">
         <require Dvendor="Microchip:3" Dname="PIC32CK0512GC01100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK1025GC00064">
         <require Dvendor="Microchip:3" Dname="PIC32CK1025GC00064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK1025GC00100">
         <require Dvendor="Microchip:3" Dname="PIC32CK1025GC00100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK1025GC01064">
         <require Dvendor="Microchip:3" Dname="PIC32CK1025GC01064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK1025GC01100">
         <require Dvendor="Microchip:3" Dname="PIC32CK1025GC01100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051GC00064">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051GC00064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051GC00100">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051GC00100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051GC00144">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051GC00144"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051GC01064">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051GC01064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051GC01100">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051GC01100"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CK2051GC01144">
         <require Dvendor="Microchip:3" Dname="PIC32CK2051GC01144"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK0512GC00064">
         <description>Headers and startup code for Microchip PIC32CK0512GC00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-GC00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-GC00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC00/gcc/gcc/startup_pic32ck0512gc00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC00/gcc/system_pic32ck0512gc00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-GC00/gcc/gcc/pic32ck0512gc00064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-GC00/gcc/gcc/pic32ck0512gc00064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC00/armcc/armcc/startup_pic32ck0512gc00064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC00/armcc/system_pic32ck0512gc00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC00/iar/iar/startup_pic32ck0512gc00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC00/iar/system_pic32ck0512gc00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-GC00/iar/config/linker/Microchip/pic32ck0512gc00064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-GC00/iar/config/linker/Microchip/pic32ck0512gc00064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK0512GC00100">
         <description>Headers and startup code for Microchip PIC32CK0512GC00100</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-GC00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-GC00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC00/gcc/gcc/startup_pic32ck0512gc00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC00/gcc/system_pic32ck0512gc00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-GC00/gcc/gcc/pic32ck0512gc00100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-GC00/gcc/gcc/pic32ck0512gc00100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC00/armcc/armcc/startup_pic32ck0512gc00100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC00/armcc/system_pic32ck0512gc00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC00/iar/iar/startup_pic32ck0512gc00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC00/iar/system_pic32ck0512gc00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-GC00/iar/config/linker/Microchip/pic32ck0512gc00100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-GC00/iar/config/linker/Microchip/pic32ck0512gc00100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK0512GC01064">
         <description>Headers and startup code for Microchip PIC32CK0512GC01064</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-GC01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-GC01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC01/gcc/gcc/startup_pic32ck0512gc01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC01/gcc/system_pic32ck0512gc01064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-GC01/gcc/gcc/pic32ck0512gc01064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-GC01/gcc/gcc/pic32ck0512gc01064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC01/armcc/armcc/startup_pic32ck0512gc01064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC01/armcc/system_pic32ck0512gc01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC01/iar/iar/startup_pic32ck0512gc01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC01/iar/system_pic32ck0512gc01064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-GC01/iar/config/linker/Microchip/pic32ck0512gc01064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-GC01/iar/config/linker/Microchip/pic32ck0512gc01064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK0512GC01100">
         <description>Headers and startup code for Microchip PIC32CK0512GC01100</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-GC01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-GC01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC01/gcc/gcc/startup_pic32ck0512gc01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC01/gcc/system_pic32ck0512gc01100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-GC01/gcc/gcc/pic32ck0512gc01100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-GC01/gcc/gcc/pic32ck0512gc01100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC01/armcc/armcc/startup_pic32ck0512gc01100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC01/armcc/system_pic32ck0512gc01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC01/iar/iar/startup_pic32ck0512gc01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC01/iar/system_pic32ck0512gc01100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-GC01/iar/config/linker/Microchip/pic32ck0512gc01100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-GC01/iar/config/linker/Microchip/pic32ck0512gc01100/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK1025GC00064">
         <description>Headers and startup code for Microchip PIC32CK1025GC00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-GC00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-GC00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC00/gcc/gcc/startup_pic32ck1025gc00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC00/gcc/system_pic32ck1025gc00064.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-GC00/gcc/gcc/pic32ck1025gc00064_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-GC00/gcc/gcc/pic32ck1025gc00064_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC00/armcc/armcc/startup_pic32ck1025gc00064.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC00/armcc/system_pic32ck1025gc00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC00/iar/iar/startup_pic32ck1025gc00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC00/iar/system_pic32ck1025gc00064.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-GC00/iar/config/linker/Microchip/pic32ck1025gc00064/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-GC00/iar/config/linker/Microchip/pic32ck1025gc00064/flash.icf"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK1025GC00100">
         <description>Headers and startup code for Microchip PIC32CK1025GC00100</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-GC00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-GC00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC00/gcc/gcc/startup_pic32ck1025gc00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC00/gcc/system_pic32ck1025gc00100.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-GC00/gcc/gcc/pic32ck1025gc00100_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-GC00/gcc/gcc/pic32ck1025gc00100_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC00/armcc/armcc/startup_pic32ck1025gc00100.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC00/armcc/system_pic32ck1025gc00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC00/iar/iar/startup_pic32ck1025gc00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC00/iar/system_pic32ck1025gc00100.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-GC00/iar/config/linker/Microchip/pic32ck1025gc00100/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-GC00/iar/config/linker/Microchip/pic32ck1025gc00100/flash.icf"
                  attr="config"/>
         </files>
      </component>
