Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/Microchip.PIC32CK-GC_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.0.0"
                 condition="PIC32CK2051GC01144">
         <description>Headers and startup code for Microchip PIC32CK2051GC01144</description>
         <files>
            <file condition="C" category="include" name="PIC32CK-GC01/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CK-GC01/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC01/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CK-GC01/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC01/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CK-GC01/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC01/gcc/gcc/startup_pic32ck2051gc01144.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CK-GC01/gcc/system_pic32ck2051gc01144.c"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CK-GC01/gcc/gcc/pic32ck2051gc01144_flash.ld"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="other"
                  name="PIC32CK-GC01/gcc/gcc/pic32ck2051gc01144_sram.ld"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC01/armcc/armcc/startup_pic32ck2051gc01144.s"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CK-GC01/armcc/system_pic32ck2051gc01144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC01/iar/iar/startup_pic32ck2051gc01144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CK-GC01/iar/system_pic32ck2051gc01144.c"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CK-GC01/iar/config/linker/Microchip/pic32ck2051gc01144/sram.icf"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="other"
                  name="PIC32CK-GC01/iar/config/linker/Microchip/pic32ck2051gc01144/flash.icf"
                  attr="config"/>
         </files>
      </component>
   </components>
</package>
